
## Plan Result (demo)




<pre><code>Plan: 3 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.postgresql_v15.azurerm_log_analytics_workspace.pgsql_log_analytics_workspace[0]
  * module.postgresql_v15.azurerm_monitor_diagnostic_setting.pgsql_diag[0]
  * module.postgresql_v15.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;track_io_timing&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.postgresql_v15.azurerm_log_analytics_workspace.pgsql_log_analytics_workspace[0] will be created
  + resource "azurerm_log_analytics_workspace" "pgsql_log_analytics_workspace" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "uksouth"
      + name                            = "ccd-data-store-api-postgres-db-v15-demo-workspace"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "ccd-data-store-api-postgres-db-v15-data-demo"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + workspace_id                    = (known after apply)
    }

  # module.postgresql_v15.azurerm_monitor_diagnostic_setting.pgsql_diag[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "pgsql_diag" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "ccd-data-store-api-postgres-db-v15-demo-to-log-analytics"
      + target_resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-data-store-api-postgres-db-v15-data-demo/providers/Microsoft.DBforPostgreSQL/flexibleServers/ccd-data-store-api-postgres-db-v15-demo"

      + enabled_log {
          + category       = "PostgreSQLFlexDatabaseXacts"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "PostgreSQLFlexQueryStoreRuntime"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "PostgreSQLFlexQueryStoreWaitStats"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "PostgreSQLFlexSessions"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "PostgreSQLFlexTableStats"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "PostgreSQLLogs"
            # (1 unchanged attribute hidden)
        }

      + log (known after apply)
    }

  # module.postgresql_v15.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["track_io_timing"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "track_io_timing"
      + server_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-data-store-api-postgres-db-v15-data-demo/providers/Microsoft.DBforPostgreSQL/flexibleServers/ccd-data-store-api-postgres-db-v15-demo"
      + value     = "on"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":2487,"Program":"tfcmt","SHA1":"","Target":"demo","Vars":{}} -->